# Challenge 3

In this challenge we will work on the `Orders` data set. In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

## Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [1]:
# import required libraries
import numpy as np
import pandas as pd

Next, extract and import `Orders` dataset into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [2]:
df = pd.read_csv("orders.csv")

In [3]:
df = pd.DataFrame(df)

In [4]:
df

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397919,541904,581587,22613,2011,12,5,12,pack of 20 spaceboy napkins,12,2011-12-09 12:50:00,0.85,12680,France,10.20
397920,541905,581587,22899,2011,12,5,12,children's apron dolly girl,6,2011-12-09 12:50:00,2.10,12680,France,12.60
397921,541906,581587,23254,2011,12,5,12,childrens cutlery dolly girl,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397922,541907,581587,23255,2011,12,5,12,childrens cutlery circus parade,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397923,541908,581587,22138,2011,12,5,12,baking set 9 piece retrospot,3,2011-12-09 12:50:00,4.95,12680,France,14.85

In [5]:
dfcopy = df.copy()

In [6]:
df["CustomerID"].unique()

array([17850, 13047, 12583, ..., 13298, 14569, 12713], dtype=int64)

In [7]:
customer = dfcopy.groupby('CustomerID').sum()

In [8]:
customer["amount_spent"]

CustomerID
12346    77183.60
12347     4310.00
12348     1797.24
12349     1757.55
12350      334.40
           ...
18280      180.60
18281       80.82
18282      178.05
18283     2094.88
18287     1837.28
Name: amount_spent, Length: 4339, dtype: float64

In [9]:
customer["amount_spent"].quantile([0.95])

0.95    5840.182
Name: amount_spent, dtype: float64

In [10]:
lista_vip95 = df[df["amount_spent"] > 5840.182]["CustomerID"]
lista_vip95

32732     15749
37126     12346
109624    15749
118352    16029
155418    15098
248706    17450
397451    16446
Name: CustomerID, dtype: int64

In [11]:
customer["amount_spent"].quantile([0.75])

0.75    1661.64
Name: amount_spent, dtype: float64

In [12]:
lista_vip75_95 = df[(df["amount_spent"] < 5840.182) & (df["amount_spent"] > 1661.64)]["CustomerID"]
lista_vip75_95

10784     18102
10786     18102
10787     18102
10788     18102
10794     18102
          ...
393237    16000
393298    15195
394417    14646
395597    16210
397110    18102
Name: CustomerID, Length: 125, dtype: int64

In [13]:
bins = (0, 1661.64, 5840.182, df["amount_spent"].max())

In [14]:
labels = ("normal", "preferente", "vip")

In [15]:
dfcopy["customer_class"] = pd.cut(dfcopy["amount_spent"], bins=bins, labels=labels)

In [16]:
dfcopy["customer_class"].unique()

['normal', NaN, 'preferente', 'vip']
Categories (3, object): ['normal' < 'preferente' < 'vip']

In [42]:
dfcopy.sample(5)

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent,customer_class
86392,130919,547520,22329,2011,3,3,14,round container set of 5 retrospot,12,2011-03-23 14:55:00,1.65,12564,France,19.80,normal
278397,385386,570197,21633,2011,10,5,15,sunflower decorative parasol,1,2011-10-07 15:45:00,12.75,13755,United Kingdom,12.75,normal
178849,256278,559471,22920,2011,7,5,13,herb marker basil,12,2011-07-08 13:39:00,0.65,17512,United Kingdom,7.80,normal
250662,350602,567656,21913,2011,9,3,14,vintage seaside jigsaw puzzles,1,2011-09-21 14:40:00,7.46,14096,United Kingdom,7.46,normal
171814,244661,558539,22178,2011,6,4,12,victorian glass hanging t-light,12,2011-06-30 12:14:00,1.25,16556,United Kingdom,15.00,normal

In [17]:
dfcopy["Country"].unique()

array(['United Kingdom', 'France', 'Australia', 'Netherlands', 'Germany',
       'Norway', 'EIRE', 'Switzerland', 'Spain', 'Poland', 'Portugal',
       'Italy', 'Belgium', 'Lithuania', 'Japan', 'Iceland',
       'Channel Islands', 'Denmark', 'Cyprus', 'Sweden', 'Finland',
       'Austria', 'Greece', 'Singapore', 'Lebanon',
       'United Arab Emirates', 'Israel', 'Saudi Arabia', 'Czech Republic',
       'Canada', 'Unspecified', 'Brazil', 'USA', 'European Community',
       'Bahrain', 'Malta', 'RSA'], dtype=object)

In [18]:
paises_vip = dfcopy[dfcopy["customer_class"] == "vip"]["Country"]
paises_vip

32732     United Kingdom
37126     United Kingdom
109624    United Kingdom
118352    United Kingdom
155418    United Kingdom
248706    United Kingdom
397451    United Kingdom
Name: Country, dtype: object

In [20]:
paises_vip.value_counts()

Country
United Kingdom    7
Name: count, dtype: int64

In [26]:
paises_vip = pd.DataFrame(paises_vip.value_counts())

In [27]:
paises_vip

                count
Country
United Kingdom      7

In [21]:
paises_preferente = dfcopy[dfcopy["customer_class"] == "preferente"]["Country"]

In [22]:
paises_preferente

10784     United Kingdom
10786     United Kingdom
10787     United Kingdom
10788     United Kingdom
10794     United Kingdom
               ...
393237    United Kingdom
393298    United Kingdom
394417       Netherlands
395597    United Kingdom
397110    United Kingdom
Name: Country, Length: 125, dtype: object

In [23]:
paises_preferente.value_counts()

Country
United Kingdom    109
EIRE                4
Singapore           4
Japan               3
Netherlands         2
France              2
Australia           1
Name: count, dtype: int64

In [28]:
paises_preferente = pd.DataFrame(paises_preferente.value_counts())

In [29]:
paises_preferente

                count
Country
United Kingdom    109
EIRE                4
Singapore           4
Japan               3
Netherlands         2
France              2
Australia           1

In [40]:
df_merged = pd.merge(paises_preferente, paises_vip, on='Country', how='outer')

In [41]:
df_merged

                count_x  count_y
Country
United Kingdom      109      7.0
EIRE                  4      NaN
Singapore             4      NaN
Japan                 3      NaN
Netherlands           2      NaN
France                2      NaN
Australia             1      NaN

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

## Q2: How to identify which country has the most VIP Customers?

In [ ]:
# your code here

## Q3: How to identify which country has the most VIP+Preferred Customers combined?

In [ ]:
# your code here